%%% -------------------------------------------------------------------
%%% Author  : rstevens
%%% Description :
%%%
%%% Created : 2012-8-20
%%% -------------------------------------------------------------------
-module(gws_connection_sup).

-behaviour(supervisor).
%% --------------------------------------------------------------------
%% Include files
%% --------------------------------------------------------------------

%% --------------------------------------------------------------------
%% External exports
%% --------------------------------------------------------------------
-export([
		 start_link/4,
		 start_child/1
		]).

%% --------------------------------------------------------------------
%% Internal exports
%% --------------------------------------------------------------------
-export([
	 init/1
        ]).

%% --------------------------------------------------------------------
%% Macros
%% --------------------------------------------------------------------
-define(SERVER, ?MODULE).

%% --------------------------------------------------------------------
%% Records
%% --------------------------------------------------------------------

%% ====================================================================
%% External functions
%% ====================================================================
start_link(Callback, IP, Port, UserArgs) ->
	%% 启动监控进程，回调本模块的 init/1
	{ok, Sup} = supervisor:start_link(
				  ?MODULE,
				  [Callback, IP, Port, UserArgs]),
	
	%% 启动第一个工作进程，传递监控进程的Pid
	start_child(Sup),
	{ok, Sup}.

start_child(Server) ->
	%% 按照子进程规范，启动一个子进程，并指定监控进程为Server
	%% 这导致调用 gws_server:start_link/3； 传递的三个参数在子进程规范中已经指定了
	supervisor:start_child(Server, []).
					  


%% ====================================================================
%% Server functions
%% ====================================================================
%% --------------------------------------------------------------------
%% Func: init/1
%% Returns: {ok,  {SupFlags,  [ChildSpec]}} |
%%          ignore                          |
%%          {error, Reason}
%% --------------------------------------------------------------------
init([Callback, IP, Port, UserArgs]) ->
	BasicSockOpts = [
					 binary,
					 {active, false},
					 {packet, http_bin},
					 {reuseaddr, true}
					],
	SockOpts = case IP of
				   undefined -> BasicSockOpts;
				   _         -> [{ip, IP} | BasicSockOpts]
			   end,
	
	%% 创建监听socket
	{ok, LSock} = gen_tcp:listen(Port, SockOpts),
	
	%% 子进程规范
	Server = {
			  gws_server, 
			  {gws_server, start_link, [Callback, LSock, UserArgs]},
			  temporary, brutal_kill, worker, [gws_server]},
	
	%% 重启策略
	RS = {simple_one_for_one, 1000, 3600},
	{ok, {RS, [Server]}}.

%% ====================================================================
%% Internal functions
%% ====================================================================

